qemu-user-targets/CVE-2015-2051/squashfs-root/htdocs/web/hnap/SetMultipleActions.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
<soap:Body>
<SetMultipleActions xmlns="http://purenetworks.com/HNAP1/">
	<SetWLanRadioSettings xmlns="http://purenetworks.com/HNAP1/">
		<Mode></Mode>
		<ChannelWidth></ChannelWidth>
		<SSIDBroadcast></SSIDBroadcast>
		<QoS></QoS>
		<Channel></Channel>
		<SecondaryChannel></SecondaryChannel>
		<SSID></SSID>
		<Enabled></Enabled>
		<RadioID></RadioID>
	</SetWLanRadioSettings>
	<SetWLanRadioSecurity xmlns="http://purenetworks.com/HNAP1/">
		<RadioID></RadioID>
		<Enabled></Enabled>
		<RadiusSecret2></RadiusSecret2>
		<Encryption></Encryption>
		<Type></Type>
		<RadiusIP1></RadiusIP1>
		<RadiusPort1></RadiusPort1>
		<RadiusSecret1></RadiusSecret1>
		<RadiusIP2></RadiusIP2>
		<RadiusPort2></RadiusPort2>
		<RadiusSecret2></RadiusSecret2>
		<KeyRenewal></KeyRenewal>
		<Key></Key>
	</SetWLanRadioSecurity>
<SetWLanRadioSettings xmlns="http://purenetworks.com/HNAP1/">
	<Mode>802.11ac</Mode>
	<ChannelWidth>0</ChannelWidth>
	<SSIDBroadcast>true</SSIDBroadcast>
	<QoS>true</QoS>
	<Channel>0</Channel>
	<SecondaryChannel>0</SecondaryChannel>
	<SSID>dlink-media-5236</SSID>
	<Enabled>true</Enabled>
	<RadioID>RADIO_5GHz</RadioID>
</SetWLanRadioSettings>
<SetWLanRadioSecurity xmlns="http://purenetworks.com/HNAP1/">
	<RadioID>RADIO_5GHz</RadioID>
	<Enabled>true</Enabled>
	<RadiusIP2></RadiusIP2>
	<RadiusPort2>0</RadiusPort2>
	<RadiusPort1>0</RadiusPort1>
	<RadiusSecret2></RadiusSecret2>
	<Encryption>TKIPORAES</Encryption>
	<Type>WPAORWPA2-PSK</Type>
	<RadiusIP1></RadiusIP1>
	<RadiusSecret1></RadiusSecret1>
	<KeyRenewal>3600</KeyRenewal>
	<Key>ixqan58609</Key>
</SetWLanRadioSecurity>
</SetMultipleActions>
</soap:Body>
</soap:Envelope>